{
  "Nate Cross": "Astral Spirits began in 2014 as a sister label to Monofonus Press in Austin, TX with the goal of releasing free jazz and improvisation on cassette tapes as a way to reach a more diverse audience and challenge expectations as well as show the breadth of improvisational music being made today.  Working at a dizzying pace, Astral Spirits has released over 125 albums on Vinyl, CD, Cassette and VHS over the past 6 years.  Although started with the help of the fine folks at Monofonus Press, Astral Spirits has largely been and remains a one person DIY operation run by Nate Cross.",
  "Macie Stewart": "\"In the 2010s, Ken Vandermark appeared on at least 100 records. The veteran saxophonist and clarinetist takes the Braxtonian imperative of self-documentation very seriously, and his recordings are rarely casual affairs—the quality goes in before the name goes on. But New Industries is his achievement of the decade. Made with Marker, a band of exciting younger Chicagoans that's also the newest group under his leadership, the 2019 album combines impeccable studio recordings with a companion CD of live versions that suggests how the scores invite reinvention each time out. With this ensemble, Vandermark has found the best vehicle yet for his compositional concept, funneling postpunk energy into exploding architecture. Issued in physical form on the reedist's own Audiographic label, New Industries sold out immediately. It resolutely requires a reprint.\" - John Corbett",
  "Olivia Junell": "Olivia Junell has been codirector of Chicago's Experimental Sound Studio since 2015 and managing director of the Hyde Park Jazz Festival since 2014. In 2015 she joined the board of Afro-feminist troupe Honey Pot Performance, whose research and outreach efforts include the Chicago Black Social Culture Map. On March 21 she helped launch the Quarantine Concerts livestream series with ESS codirectors Adam Vida and Alex Inglizian, drummer Ben Billington, and guitarist Daniel Wyche.",
  "Kim Alpert": "Kim Alpert believes in human-centric design and integrating technology with strategy in her time-based projects. With a background in fine art, music, and carpentry, Kim brings an attention to detail and diverse styles to both her art and commercial work.\n\nKim holds a degree in Digital Art & Design from Full Sail University and was inducted into their hall of fame in 2013. She has shown art at places like Stony Island Arts Bank, SOFA Expo, The Modern Wing at the Art Institute of Chicago and Facets Cinematheque. She has an interactive room to visualize and create sound as part of the permanent collection at the National Music Center/Studio Bell in Canada. Kim tours internationally with performance projects building digital and analog video systems. Her performance practice include works with Mike Reed, Rob Mazurek, Matthew Lux, The Instigation Orchestra and a host of other artists.",
  "Jaap Blonk": "Jaap Blonk is a self-taught composer, performer and poet. In the late 1970s he took up saxophone and started to compose music. A few years later he discovered his potential as a vocal performer, at first in reciting poetry and later on in improvisations and his own compositions. For almost two decades the voice was his main means for the discovery and development of new sounds. From around the year 2000 on Blonk started work with electronics, at first using samples of his own voice, then extending the field to include pure sound synthesis as well as work with analog synthesizers.",
  "Frode Gjerstad": "Frode Gjerstad is one of the few Norwegian musicians playing modern improvised music outside the 'ECM-school.'\n\nHis current groups include: the Frode Gjerstad Trio with William Parker, bass and Rashid Bakr, drums; the Circulasione Totale Orchestra with young Norwegian musicians; and a quartet completed by Hasse Poulsen, guitars, Nick Stephens, bass, and Louis Moholo, drums. Frode Gjerstad has received several grants from different foundations and has been very active in the Norwegian Jazzmusicians Federation as well as in the committee for the Norwegian Contemporary Music Federation. He runs his own label, Circulasione Totale.",
  "John Corbett": "John Corbett is a writer and independent curator based in Chicago, where he is co-owner of Corbett vs. Dempsey art gallery.  He is the author of Extended Play:  Sounding Off from John Cage to Dr. Funkenstein (Duke U. Press, 1994), as well as several books on Sun Ra.  He co-curated the Empty Bottle Festival of Jazz and Improvised Music (1996-2005) in Chicago, served as Artistic Director of JazzFest Berlin (2002), and co-curated (with Christopher Wool) events such as Nation Time at the Guggenheim Museum, New York (2013) and Loose Booty at the Art Institute of Chicago (2014).  Over the last 15 years, Corbett has produced more than 100 CDs of creative music, both on his Unheard Music Series and recently on the Corbett vs. Dempsey label.","Bonnie Jones": "Bonnie Jones is a Korean-American improvising musician, poet, and educator working primarily with electronic sound and text. Her work uses electronic noise (field recordings, circuit bending) and text (poetry, found, spoken, visual) to make visible/audible the often invisible, fluid, and in-between states of self and identity. Jones has been an active improvising musician since 1999, and has released several recordings of collaborative and solo projects. As a Baltimore-based arts organizer, Jones was a founding member of both the Transmodern Festival and CHELA Gallery, and is a member of the High Zero Festival and of the Red Room collective. In 2010, Jones and Suzanne Thorpe co-founded TECHNE, an organization whose primary program introduces female-identifying youth to technology-focused art making, improvisation, and community collaboration.",
  "Brandon Lopez": "Improviser/Composer Brandon A. Lopez has been deemed the “Ubiquitous Free Improv Bass Ace” by the Village Voice and said to play with a “Bruising Physicality” by the Chicago Reader. He was born and raised in the splendors of Northwestern New Jersey, in the shadow of the (New York) city. It was there that he cultivated a taste for left-of-center music and subsequently, dug graves.\n\nHe’s had the pleasure of working with many of the world’s luminary, left-of-center musicians and is a frequent collaborator with Weasel Walter, Nate Wooley, Mette Rasmussen, Gerald Cleaver, Peter Evans, Ingrid Laubrock, Dave Rempis, just to name a few. He has toured and played prestigious halls, DIY basements, and festivals all across North America and the European Continent. He currently leads a piano trio dubbed “Mess” with Sam Yulsman and Chris Corsano. He frequently plays solo. He is also the 2018 Artist in Residence at Issue Project Room. He attended New England Conservatory.",
  "Patrick Cain": "Originally from Buffalo, New York, Patrick Cain was immersed in the vibrant experimental music and media community of the Queen City. He has worked in theater, performance, dance, noise, costumes and installation art. He was a Squeaky Wheel Media Arts Center artist in residence in 2012, and also a guest artist at Alfred University. His recent work is inspired by mid-century experimental film making, early electronic musics and nature. He has toured the Midwest and East Coast with the Freeman/Borden/Cain trio and has shared bills with countless experimental music luminaries. He has screened at the Burchfield Penney Art Center and as a part of the Sonic Circuits series in Washington, DC.",
  "Claire Rousay": "Claire Rousay is a person who performs and records. She currently lives in San Antonio, Texas.\n\nHer performances and recordings explore queerness, human relationships, and self perception.Chris Corsano",
  "Chris Corsano": "(b. 1975, USA) is an upstate NY-based drummer who has been active at the intersections of collective improvisation, free jazz, avant-rock, and noise music since the late 1990's. He began a long-standing, high-energy musical partnership with saxophonist Paul Flaherty in 1998. Their style, which they occasionally refer to with (semi-)tongue-in-cheek humor as \"The Hated Music\", combines modern free-jazz's ecstatic collectivist spirit and the urgency and intensity of hardcore punk.\n\nA move from western Massachusetts to the UK in 2005 led Corsano to develop his solo music--a dynamic, spontaneously-composed amalgam of extended techniques for drum set and non-percussive instruments of his own making: e.g. bowed violin strings stretched across drum heads, modified reed instruments, and stockpiles of resonant metal. In February 2006, Corsano released his first solo recording, The Young Cricketer, and toured extensively throughout Europe, USA, Australia, and Japan. He spent 2007 and '08 as the drummer on Björk's Volta world tour, all the while weaving in shows and recordings on his days off with the likes of Evan Parker, Virginia Genta, C. Spencer Yeh, and Jandek.\n\nMoving back to the U.S. in 2009, Corsano returned focus to his own projects, including a duo with Michael Flower, Vampire Belt (with Bill Nace), Rangda (with Richard Bishop and Ben Chasny) and his solo work, further expanded in its use of contact microphones and synthesizers. In 2017, he received the Foundation for Contemporary Arts Grants to Artist Award.",
  "Susan Alcorn": "One of the world’s premiere exponents of her instrument, Susan Alcorn has taken the pedal steel guitar far beyond its traditional role in country music. Having first paid her dues in Texas country & western bands, she began to expand the vocabulary of her instrument through her study of 20th century classical music, visionary jazz, and world musics.\n\nThough known as for her solo work, she has collaborated with numerous artists including Pauline Oliveros, Chris Cutler, the London Improvisors Orchestra, the Glasgow Improvisors Orchestra, Joe McPhee, Ken Vandermark, Nate Wooley, Ingrid Laubrock and Leila Bourdreuil, George Burtm, Evan Parker, Michael Formanek, Zane Campbell, and Mary Halvorson among others.",
  "Hakon Kornstad": "Håkon Kornstad is an award winning Norwegian jazz saxophonist, recognised by jazz critics around the world. In 2009 he discovered his singing voice, and he finished a master’s degree at the Norwegian Opera Academy in 2014. He is now dividing his time between two almost contrasting musical genres — combining them in unprecedented ways.",
  "Fred Lonberg-Holm": "Fred Lonberg-Holm enjoys working with a wide variety of musicians in as many situations as possible.   Current and ongoing projects include Stirrup (Charles Rumback and Nick Macri),  Ballister,  Joe McPhee’s Survival Unit III,  Screw and Straw, the Party Knüllers as well as numerous one off projects.Past ensembles of note include the Brötzmann Chicago Tentet, Anthony Coleman's Self Haters Orchestra, The Valentine Trio, The Boxhead Ensemble, ADA trio (w/ Peter Brötzmann and Paal Nilssen-Love), the Vandermark Five and Ken Vandermark's Frame Quartet, Seval, Friction Brothers and Terminal 4.Improvisors he has worked with include Clare Cooper, Charlotte Hug, Andrea Neumann, Sofia Jernberg,  Jaimie Branch, Shelly Hirsch, Tomeka Reid, Michiyo Yagi, Carrie Shull, Gunda Gottschalk, Carrie Biolo, Birgitte Uhler, Rachel Wadham,  Mary Halvorson, Joelle Leandre, Joanne Powers, Zeena Parkins,   Lotte Anker, Tine Asmundsen, Jessica Pavone as well as a number of guys.   He also leads a revolving cast large ensembles under the name Lightbox Orchestra. His extensive discography includes free improvised and free jazz recordings as well as new music, pop, rock and noise.",
  "Federico Peñalva": "Buenos Aires based artists who works in different fields such as painting, photography, graphic design, music and visuals in motion. He runs an independent label dedicated to his work with sound and visuals. Besides his independent work as an artist, He’s currently working for Ken Vandermark’s Audiographic Records, Tim Daisy’s Relay Recordings and at Catalytic Sound as designer, and made several covers for other labels including Trost, Bocian, Clean Feed, Not Two, ESS Option Series, Sound American and Pleasure of the Text Records.",
  "Steve Marquette": "Steve Marquette is a guitarist, improviser and organizer based out of Chicago, IL. Over the past decade he has become an integral part of the city's storied and vibrant improvised music community, in ensembles of his own (The Few with Macie Stewart and Charlie Kirchen, Kobra Quartet, Instigation Orchestra) and as a member of Ken Vandermark's Marker among other projects. In addition to his work as a musician, he is also a founder and lead organizer of the Instigation Festival - which brings music, movement and video artists from Chicago and New Orleans together for a week of interdisciplinary collaboration in each city.",
  "Andrew Clinkman": "Andrew Clinkman (b. 1991) is a Chicago based guitarist whose work primarily centers around experimental and improvised music. In addition to solo guitar work and many ad hoc collaborations, he is an active member of several bands including Marker led by composer and saxophonist Ken Vandermark, and weirdo rock group Spirits Having Fun. He has also been a co-curator of the Option series at Experimental Sound Studio in Chicago since June 2015 along with Ken Vandermark and Tim Daisy.",
  "Sam Clapp": "Sam Clapp is an arts organizer, musician, audio engineer, and sound designer. He is the manager of the Catalytic Sound Co-op.",
  "Andy Moor": "Andy Moor began his musical life in Edinburgh, Scotland playing guitar with Dog Faced Hermans, an eclectic group that mixed post-punk energy with traditional tunes and improvisations.",
  "Ab Baars": "Dutch musician-composer and bandleader Ab Baars performs on tenor saxophone, clarinet and shakuhachi. He focuses mainly on Ab Baars Solo, Baars-Buis, Fish Scale Sunrise, Perch Hen Brock & Rain, Ab Baars Trio, Duo Baars-Henneman and the ICP Orchestra.",
  "Ben Hall": "Ben Hall studied W. African percussion with Jumma Santos and trapset and precognition with Milford Graves at Bennington College in where he also worked with Bill Dixon on his last small group recordings. Hall is currently a research fellow at the Center for the Advancement of Public Action at Bennington College.",
  "Dave Rempis": "Saxophonist, improviser, and composer Dave Rempis has been an integral part of the thriving Chicago jazz and improvised music scene since 1997. With a background in ethnomusicology and African studies at Northwestern University, including a year spent at the University of Ghana, Rempis burst onto the creative music scene at the age of 22 when he was asked to join the now-legendary Chicago jazz outfit The Vandermark Five. This opportunity catapulted him to notoriety as he began to tour regularly throughout the US and Europe, an active schedule that he still maintains to the present day. At the same time, Rempis began to develop the many Chicago-based groups for which he’s currently known, including The Rempis Percussion Quartet, The Engines, Ballister, Rempis/Abrams/Ra, Wheelhouse, Triage, The Rempis/Rosaly Duo, and The Rempis/Daisy Duo. Other collaborations have included work with Paul Lytton, Fred Anderson, Peter Brötzmann, Hamid Drake, Tomeka Reid, Steve Swell, Elisabeth Harnik, John Tchicai, Roscoe Mitchell, Nate Wooley, Kevin Drumm, Paal Nilssen-Love, Nels Cline, and Joe McPhee. In 2013, he started his own record label, Aerophonic Records, to document this ongoing work. Rempis has been named regularly since 2006 in the annual Downbeat Critics’s Poll as a “rising star” on both alto and baritone saxophone, a category that he won in 2017. He was also the recipient of a Ragdale Fellowship from the Herb Alpert Foundation in 2017, as well as an Individual Artists Program grant from the City of Chicago for his solo project \"Lattice.\"",
  "Elisabeth Harnik": "Elisabeth Harnik, an Austria based pianist and composer with Slovene roots has created a multi-faceted body of work by blurring genre boundaries through various collaborations in the field of improvised music, interdisciplinary projects, and contemporary compositional works. She studied classical piano and later – with Beat Furrer – composition at the University of Music and Performing Arts, Graz. As an improviser she works within an electro-acoustic inspired sound-world, using specific preparations and extended techniques while pushing the limitations of the piano. Her performances draw from physicality and introspection, intuitive playing and high precision. Harnik´s unique approach to her instrument as well as to improvisation and composition has led to many concert invitations. She is a member of numerous ensembles for improvised music and has performed and recorded with a number of internationally recognized representatives of the contemporary jazz scene in Europe and abroad. She writes commissioned works in addition to her concert activities, and her compositions are performed regularly at concerts and festivals for new music.",
  "Ig Henneman": "Dutch musician-composer and bandleader Ig Henneman performs on viola, and writes compositions for orchestras, ensembles, soloists, including pieces for film and theater. As an improviser, she mainly focuses on the Ig Henneman Sextet, Duo Baars-Henneman and Perch Hen Brock & Rain.",
  "Ikue Mori": "Ikue Mori moved from her native city of Tokyo to New York in 1977. She started playing drums and soon formed the seminal NO WAVE band DNA, with fellow noise pioneers Arto Lindsay and Tim Wright. In the mid 80's Ikue started to employ drum machines in the unlikely context of improvised music. Since that time she has transitioned to the laptop as her primary instrument. Current working groups include MEPHISTA with Sylvie Courvoisier and Susie Ibarra, PHANTOM ORCHARD with Zeena Parkins, a project with Koichi Makigami, Twindrums with YoshimiO,  Highsmith with Craig Taborn, Obelisk and various ensembles of John Zorn.",
  "Ingebrigt Haker Flatern": "A muscular player whose tone and attack run the gamut from Paul Chambers to Buschi Niebergall, his sense of both openness and control serves ensembles as diverse as The Thing, Free Fall, Atomic, Scorch Trio and the Kornstad/Håker Flaten Duo. In addition to his own Chicago Sextet and Austin-centric Young Mothers, Flaten has also recorded and performed with Frode Gjerstad, Dave Rempis, Bobby Bradford, the AALY Trio, Ken Vandermark, Stephen Gauci, Tony Malaby, Daniel Levin, Dennis Gonzalez and numerous others. Flaten studied at the Conservatory in Trondheim (1992-1995), turning professional shortly afterward, yet his hunger to play in new situations with new musicians – schooled or amateur, frequently recorded or just starting out – puts him in a rare class, that of a truly broad-minded artist. That mettle has served him well, living and developing the music under his own steam and drawing from influences as diverse as Derek Bailey, George Russell, Chris McGregor, filmmakers Ingmar Bergman, contemporary pop melody and gritty punk music as well as everyday sights and sounds.",
  "Joe McPhee": "Joe McPhee, born November 3,1939 in Miami, Florida, USA, is a multi-instrumentalist, composer, improviser, conceptualist and theoretician. He is currently the member of Trio X, Survival Unit III and has collaborated with Pauline Oliveros, Peter Brotzmann, Evan Parker, Raymond Boni, The Thing, Trespass Trio, and Universal Indians among many others. With a career spanning nearly 50 years and over 100 recordings, he continues to tour internationally, forge new connections and reach for music’s outer limits.",
  "Joe Morris": "Since 1994 he has recorded for the labels ECM, Hat Hut, Leo, Incus, Okka Disc, Homestead, About Time, Knitting Factory Works, No More Records, AUM Fidelity and OmniTone and Avant. He has toured throughout the U.S., Canada and Europe as a solo and as a leader of a trio and a quartet. Since 1993 he has recorded and/or performed with among others; Matthew Shipp, William Parker, Joe and Mat Maneri, Rob Brown, Raphe Malik, Ivo Pearlman, Borah Bergman, Andrea Parkins, Whit Dickey, Ken Vandermark, DKV Trio, Karen Borca, Eugene Chadborne, Susie Ibarra, Hession/Wilkinson/Fell, Roy Campbell Jr., John Butcher, Aaly Trio, Hamid Drake, Fully Celebrated Orchestra and others. He began playing acoustic bass in 2000 and has since performed with cellist Daniel Levin, Whit Dickey and recorded with pianist Steve Lantner. He has lectured and conducted workshops throughout the US and Europe. He is a former member of the faculty of Tufts University Extension College and is currently on the faculty at New England Conservatory in the jazz and improvisation department. He was nominated as Best Guitarist of the year 1998 and 2002 at the New York Jazz Awards.",
  "Ken Vandermark": "Ken Vandermark is an American jazz composer, saxophonist, and clarinetist. A fixture on the Chicago-area music scene since the 1990s, Vandermark has earned wide critical praise for his playing and his multilayered compositions, which typically balance intricate orchestration with passionate improvisation. He has led or been a member of many groups, has collaborated with many other musicians, and was awarded a 1999 MacArthur Fellowship. He plays tenor saxophone, clarinet, bass clarinet, and baritone saxophone.",
  "Luke Stewart": "Luke Stewart is a D.C. based bassist, saxophonist and activist whose work and associations defy genre and easy definition.  He had the honor of studying and performing with saxophonist Hamiett Bluiett.  Recently he lead a 12-member ensemble in an hour-long tribute to John Coltrane on his birthday at the legendary Bohemian Caverns.  He is also a member of Trio OOO, a collaborative ensemble featuring saxophonist Aaron Martin, and drummer Sam Lohman. In addition, he has helped establish CapitalBop.com, a DC-based jazz website and 501c3 non-profit organization, as its Avant Music Editor.",
  "Mats Gustafssson": "Born 1964 in Umeå, Northern Sweden. Saxplayer, improviser and composer. Solo artist and international tours and projects with a.o. Sonic Youth, Merzbow, Jim O´Rourke, Barry Guy, Otomo Yoshihide, Yoshimi, Ken Vandermark and in working groups The Thing, FIRE!, Gush, Boots Brown, Swedish Azz and Fake (the facts). Large ensemble work with Barry Guy New Orchestra,FIRE! Orchestra and the NU – ensemble.over 1800 concerts and over 200 record productions in Europe, Australia, Africa, North & South America and Asia. Collaborations with contemporary dance, theater, art, poetry as well as projects with noise, electronica, contemporary rock and free jazz.",
  "Nate Wooley": "He has performed regularly with such icons as John Zorn, Anthony Braxton, Eliane Radigue, Ken Vandermark, Fred Frith, Evan Parker, and Yoshi Wada, as well as being a collaborator with some of the brightest lights of his generation like Chris Corsano, C. Spencer Yeh, Peter Evans, and Mary Halvorson. Wooley's solo playing has often been cited as being a part of an international revolution in improvised trumpet. Along with Peter Evans and Greg Kelley, Wooley is considered one of the leading lights of the American movement to redefine the physical boundaries of the horn, as well as demolishing the way trumpet is perceived in a historical context still overshadowed by Louis Armstrong. A combination of vocalization, extreme extended technique, noise and drone aesthetics, amplification and feedback, and compositional rigor has led one reviewer to call his solo recordings \"exquisitely hostile\".",
  "Paal Nilssen-Love": "Being active in several bands at the same time has always been Paal’s deliberate working method. He is constantly conscious about the projects he is in, as his participation in each and one of them is fully dedicated. Playing is not about getting from start to goal, but rather being in an everlasting process, a continuous movement where each new piece of music performed is a prolongation of the latest. Hence, keeping focused and concentrating all energy around what’s happening there and then is of greatest importance - as is the freedom in the music, the ability of being free within the expression.",
  "Sylvie Courvoisier": "Sylvie Courvoisier is a pianist, composer, and improviser. Born in Lausanne, Switzerland, Courvoisier moved to New York in 1998 and has lived in Brooklyn since that time. Courvoisier has led multiple groups over the years and has recorded 8 albums as a band leader and 50 albums (25 as a co-leader and 25 as a side-person) for different labels, notably ECM, Tzadik and Intakt Records. She has been commissioned to write music for concerts, radio, dance and theater. Since 1996, she has been touring widely with her own groups and as a side person in USA, Canada, Japan, Australia and Europe. Courvoisier has performed and recorded with John Zorn, Mark Feldman, Yusef Lateef, Ikue Mori, Tony Oxley, Mary Halvorson, Ingrid Laubrock, Tim Berne, Joey Baron, Joëlle Léandre, Herb Robertson, Butch Morris, Evan Parker, Ellery Eskelin, Fred Frith, Nate Wooley, Tomazs Stanko, Susie Ibarra, Wadada Leo Smith and the flamenco dancer Israel Galvan among others.",
  "Terrie Hessels": "Terrie Hessels is an improvising guitarist from the Netherlands. In addition to his work as an improviser, he's a founding member of the iconic Dutch punk band The Ex. Terrie founded the Terp label to document the work of Ethiopian musicians as well as his own improvising projects.",
  "Tim Daisy": "Tim Daisy is an American drummer and composer working in the fields of improvised and composed music. Tim moved to Chicago in 1997 and since that time has performed, recorded, and toured with many national and international improvised musicians and ensembles. He was a member of the Vandermark 5 from 2002 to 2010. He has also performed with Dave Rempis, Jeb Bishop, Mars Williams, Steve Swell, Jaimie Branch, Katherine Young, Fred Lonberg-Holm, James Falzone, Russ Johnson, Katinka Kleijn, Elizabeth Harnik, Christof Kurzmann, Ikue Mori, Rafael Toral, Mikolaj Trzaska, Per Ake Holmlander, Darren Johnston, Havard Wiik, Jason Stein and Michael Zerang. In 2011 he received the New Music America Composers Assistance Award and in 2011, 2012 and 2017 the ASCAP Plus Award from the American Society of Composers, Authors and Publishers . He has recorded over one hundred and thirty albums as a sideman or leader for labels including Relay, (which he owns and operates), Not Two, Clean Feed, Astral Spirits, Aerophonic, Audiographic, Sonorus, Trost, Utech, New World, and Okka Disk. Tim co-curates the weekly OPTION series at Experimental Sound Studio in Chicago. The programming explores contemporary perspectives on improvisation and composition in a ‘salon’ format, enabling local, national, and international artists to publicly discuss their practice and ideas as well as perform"
}